<template>
  <div id="app">
    <div ref="test" class="test" v-loading="loading">12313213</div>
    <button style="margin-left: 100px" @click="hanldeClick">click me</button>
  </div>
</template>

<script>
import Loading from '../packages/Loading';

export default {
  name: 'App',
  directives: {
    Loading
  },
  data () {
    return {
      loading: false
    };
  },
  methods: {
    hanldeClick () {
      this.loading = true;
      setTimeout(() => {
        const txt = document.createElement('span');
        txt.innerHTML = '放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见放辣椒放辣椒风口浪尖萨芬了看见\n放辣椒放辣椒风口浪尖萨芬了看见';
        this.$refs.test.appendChild(txt);
        this.loading = false;
      }, 3000);
    }
  }
}
</script>

<style lang="scss">
  .test {
    width: 100px;
    height: 200px;
    border: 10px solid red;
  }
</style>